In [14]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt 
%matplotlib inline
from  sklearn import linear_model
from word2number import w2n

In [15]:
df=pd.read_excel("salary training data.xlsx")
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    NaN                         NaN        NaN
1         NaN                    8.0                         9.0    50000.0
2         NaN                    8.0                         6.0    45000.0
3         5.0                    6.0                         7.0    60000.0
4         2.0                   10.0                        10.0    65000.0
5         7.0                    9.0                         6.0    70000.0
6         3.0                    7.0                        10.0    62000.0
7        10.0                    NaN                         7.0    72000.0
8        11.0                    7.0                         8.0    80000.0

In [16]:
df.experience=df.experience.fillna(0)

In [17]:
import math
median_test_score = math.floor(df['test_score(out of 10)'].mean())
median_test_score
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(median_test_score)

In [18]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    7.0                         NaN        NaN
1         0.0                    8.0                         9.0    50000.0
2         0.0                    8.0                         6.0    45000.0
3         5.0                    6.0                         7.0    60000.0
4         2.0                   10.0                        10.0    65000.0
5         7.0                    9.0                         6.0    70000.0
6         3.0                    7.0                        10.0    62000.0
7        10.0                    7.0                         7.0    72000.0
8        11.0                    7.0                         8.0    80000.0

In [19]:
median_inter=math.floor(df['interview_score(out of 10)'].mean())
df['interview_score(out of 10)']=df['interview_score(out of 10)'].fillna(median_inter)

In [20]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    7.0                         7.0        NaN
1         0.0                    8.0                         9.0    50000.0
2         0.0                    8.0                         6.0    45000.0
3         5.0                    6.0                         7.0    60000.0
4         2.0                   10.0                        10.0    65000.0
5         7.0                    9.0                         6.0    70000.0
6         3.0                    7.0                        10.0    62000.0
7        10.0                    7.0                         7.0    72000.0
8        11.0                    7.0                         8.0    80000.0

In [21]:
median_sal=math.floor(df['salary($)'].mean())

In [22]:
df['salary($)']=df['salary($)'].fillna(median_sal)

In [23]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    7.0                         7.0    63000.0
1         0.0                    8.0                         9.0    50000.0
2         0.0                    8.0                         6.0    45000.0
3         5.0                    6.0                         7.0    60000.0
4         2.0                   10.0                        10.0    65000.0
5         7.0                    9.0                         6.0    70000.0
6         3.0                    7.0                        10.0    62000.0
7        10.0                    7.0                         7.0    72000.0
8        11.0                    7.0                         8.0    80000.0

In [24]:
reg=linear_model.LinearRegression()
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)',]],df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [26]:
reg.predict([[2,9,6]])

array([56820.85106383])

In [28]:
reg.predict([[12,10,10]])

array([85786.45267792])